[
    [
        {
            "textsWithKeyWords": {
                "text": [
                    "\"Parklands Turf is a great company to work with, nothing is ever a hassle or job to big or small. They’re always on time with excellent gear and willing to go the extra mile. I would and have recommended Parklands Turf to do a top quality job with any sports turf or home lawn.\" ",
                    "\"We have been associated with Parklands Turf over the last year, as we have grassed areas around our new home. We have found their service and product to be great. Any problem has been dealt with quickly and efficiently. They have excellent support associates e.g. weed sprayers. Parklands Turf also are aware of their surroundings and are tidy workers. We heartily recommend Parklands Turf as a reliable, pleasant and professional business in the area of grassing large rural areas.\" ",
                    "\"We found Parklands Turf reliable and very efficient. They finished what they quoted within the timeframe and their after service was excellent. We would recommend Parklands Turf to anyone.\" ",
                    "Making and keeping your turf green",
                    "Parklands Turf is a recognised leader for everything to do with turf. Numerous residential and commercial customers have been very happy to accept our advice and have proceeded to have their sports turf and lifestyle lawns renovated and maintained by Parklands Turf. Feel free to read their testimonials below.",
                    "-\tJonathon Huntley, head green keeper, St Peter School"
                ],
                "keywords": [
                    "eco",
                    "green"
                ]
            },
            "page": "https://www.parklandsturf.co.nz/contact"
        },
        {
            "textsWithKeyWords": {
                "text": [
                    "Specialising in sports turf renovation, development and maintenance, we can make and keep your turf green with high-density turf upgrades. The types of turf we can service include:",
                    "Parklands Turf has a formidable team with a vast array of knowledge, which will work to the benefit of your project. We also have an injury-free record and prioritise the observation and practice of all modern safety requirements."
                ],
                "keywords": [
                    "eco",
                    "green"
                ]
            },
            "page": "https://www.parklandsturf.co.nz/aboutservices"
        },
        {
            "textsWithKeyWords": {
                "text": [
                    "Specialising in sports turf renovation, development and maintenance, we can make and keep your turf green with high-density turf upgrades. ",
                    "The team at Parklands Turf has been making and keeping turf green throughout the North Island for a long time."
                ],
                "keywords": [
                    "green"
                ]
            },
            "page": "https://www.parklandsturf.co.nz/sports-turf"
        },
        {
            "textsWithKeyWords": {
                "text": [
                    "Enjoy lush green turf every day"
                ],
                "keywords": [
                    "green"
                ]
            },
            "page": "https://www.parklandsturf.co.nz/lifestyle-lawns"
        },
        {
            "textsWithKeyWords": {
                "text": [],
                "keywords": [
                    "green"
                ]
            },
            "page": "https://www.parklandsturf.co.nz/"
        }
    ],
    [
        "www.parklandsturf.co.nz",
        "1",
        "Agriculture",
        "113",
        "Turf Growing"
    ],
    [
        {
            "textsWithKeyWords": {
                "text": [
                    "Our golfing surfaces can be found installed as a putting green in residential gardens, on professional club courses and also at mini-golf courses.",
                    "Readylawns very popular shorter length turf that still looks natural. Ideal for all landscape applications and meets a price point. Perfect for dog runs, and utility areas",
                    "A great turf suitable for a cricket pitch, providing consistent bounce performance. The yarn is heavily UV protected and built to withstand the harsh climatic conditions. A dense but very short pile of 9mm designed specifically for cricket at every playing level. Recommended for cricket clubs, schools, council parks and indoor centers for both main and practice wickets. Popular and long lasting.",
                    "natural grass",
                    "Contact the office for a free quote to install your own putting green",
                    "Readylawns best selling deeper green turf, 37mm pile. Comes in a 4m roll so less joins.  A perfect landscape turf for all environments, soft under foot, but hard wearing too",
                    "Our landscaping ranges need no mowing, look manicured all year round, drain and wear better than natural grass, reduce nuisance insects, are easy to clean and child and pet friendly.",
                    "The Urban Bayside synthetic turf is a very natural looking product providing great durability and comfort using state of the art Polyethylene multifilament yarn. The UV protected turf will outlast harsh weather conditions and allow for a hassle-free lawn which does not require mowing or watering."
                ],
                "keywords": [
                    "eco",
                    "green",
                    "natural"
                ]
            },
            "page": "https://www.readylawn.co.nz/artificial-grass/"
        },
        {
            "textsWithKeyWords": {
                "text": [
                    "We are enjoying standing on the deck and surveying the swath of bright green. ",
                    "natural grass ",
                    "Readylawn will give you a lush springy, green lawn within hours whatever option you choose",
                    "feels like natural grass"
                ],
                "keywords": [
                    "green",
                    "natural"
                ]
            },
            "page": "https://www.readylawn.co.nz#quote"
        },
        {
            "textsWithKeyWords": {
                "text": [
                    "The Readylawn name has become generic for instant roll out turf in New Zealand.  You can only buy the genuine product off a licensed Readylawn business.",
                    "natural grass lawn"
                ],
                "keywords": [
                    "eco",
                    "natural"
                ]
            },
            "page": "https://www.readylawn.co.nz/about/#meet-the-team"
        },
        {
            "textsWithKeyWords": {
                "text": [],
                "keywords": [
                    "green",
                    "natural"
                ]
            },
            "page": "https://www.readylawn.co.nz#"
        }
    ],
    [
        "www.readylawn.co.nz",
        "1",
        "Agriculture",
        "113",
        "Turf Growing"
    ],
    [
        {
            "textsWithKeyWords": {
                "text": [
                    "We also try to foster a fun atmosphere at work and on premises we have a basketball hoop, putting green and cricket pitch which is used regularly after work by our employees to wind down.",
                    "Actively using the AgRecovery recycling program for chemical containers"
                ],
                "keywords": [
                    "eco",
                    "green"
                ]
            },
            "page": "https://www.lawnandturf.co.nz/our-values#innovation"
        },
        {
            "textsWithKeyWords": {
                "text": [],
                "keywords": [
                    "eco",
                    "green"
                ]
            },
            "page": "https://www.lawnandturf.co.nz/our-values#staff"
        }
    ],
    [
        "www.lawnandturf.co.nz",
        "1",
        "Agriculture",
        "113",
        "Turf Growing"
    ],
    [
        {
            "textsWithKeyWords": {
                "text": [
                    "\"We asked Turf Services to come to our property to quote for a new lawn. We were impressed with Jeremy's quote, it was prompt and we accepted it. Even better, the work was done and completed on time and to an excellent standard. We highly recommend Turf Services, we found the team reliable, hard-working and conscientious.\"",
                    "\"We asked Turf Services to come to our property to quote for a new lawn. We were impressed with Jeremy's quote, it was prompt and we accepted it. Even better, the work was done and completed on time and to an excellent standard. We highly recommend Turf Services, we found the team reliable, hard-working and conscientious.\"",
                    "\"We asked Turf Services to come to our property to quote for a new lawn. We were impressed with Jeremy's quote, it was prompt and we accepted it. Even better, the work was done and completed on time and to an excellent standard. We highly recommend Turf Services, we found the team reliable, hard-working and conscientious.\"",
                    "\"We asked Turf Services to come to our property to quote for a new lawn. We were impressed with Jeremy's quote, it was prompt and we accepted it. Even better, the work was done and completed on time and to an excellent standard. We highly recommend Turf Services, we found the team reliable, hard-working and conscientious.\"",
                    "Professional sports turf surfaces includes, golf course greens/tees and fairways, Sports fields - Rugby & Soccer Fields,"
                ],
                "keywords": [
                    "eco",
                    "green"
                ]
            },
            "page": "https://www.turfservices.co.nz#sportsfield"
        },
        {
            "textsWithKeyWords": {
                "text": [],
                "keywords": [
                    "eco",
                    "green"
                ]
            },
            "page": "https://www.turfservices.co.nz#fl-main-content"
        },
        {
            "textsWithKeyWords": {
                "text": [],
                "keywords": [
                    "eco",
                    "green"
                ]
            },
            "page": "https://www.turfservices.co.nz#navigation-ourservices"
        },
        {
            "textsWithKeyWords": {
                "text": [],
                "keywords": [
                    "eco",
                    "green"
                ]
            },
            "page": "https://www.turfservices.co.nz#navigation-whoweare"
        },
        {
            "textsWithKeyWords": {
                "text": [],
                "keywords": [
                    "eco",
                    "green"
                ]
            },
            "page": "https://www.turfservices.co.nz#quote"
        },
        {
            "textsWithKeyWords": {
                "text": [],
                "keywords": [
                    "eco",
                    "green"
                ]
            },
            "page": "https://www.turfservices.co.nz#hydroseeding"
        }
    ],
    [
        "www.turfservices.co.nz",
        "1",
        "Agriculture",
        "113",
        "Turf Growing"
    ],
    [
        {
            "textsWithKeyWords": {
                "text": [
                    "We seek out the best organic and natural food products New Zealand has to offer. ",
                    "We seek out the best organic and natural food products New Zealand has to offer. ",
                    "We seek out the best organic and natural food products New Zealand has to offer. ",
                    "We seek out the best organic and natural food products New Zealand has to offer. "
                ],
                "keywords": [
                    "natural",
                    "organic"
                ]
            },
            "page": "https://www.nznaturalexports.co.nz#"
        }
    ],
    [
        "www.nznaturalexports.co.nz",
        "1",
        "Agriculture",
        "114",
        "Floriculture Production (Under Cover)"
    ],
    [
        {
            "textsWithKeyWords": {
                "text": [
                    "matt@northlandnaturals.co.nz",
                    "Organic Microgreens in Heat-Sealed Compostable Plastic Bags (also for retail stores, lower-cost packaging): ",
                    "Organic Microgreens on Special:",
                    "Leafy greens box: Coming Soon. Depending on seasonal availability, may include mesclun, spinach, kale, silverbeet, celery, pak choi, and kale",
                    "Organic Microgreens",
                    "Microgreens bulk box: $30. Includes 6x $6 bags of microgreens",
                    "Organic Microgreens in compostable clam shells (for retail stores with good display):",
                    "matt@northlandnaturals.nz",
                    "Organic Microgreens Loose on orders less than 400g (eg cafes): ",
                    "matt@northlandnaturals.co.nz ",
                    "Organic Microgreens Loose on orders over 400g (eg high-end restaurants, or anyone who strongly believes in supporting local and organics and is willing to pay more for them):"
                ],
                "keywords": [
                    "compostable",
                    "green",
                    "natural",
                    "organic"
                ]
            },
            "page": "https://northlandnaturals.nz/produce"
        },
        {
            "textsWithKeyWords": {
                "text": [
                    "Get organic produce with optimal nutrition",
                    "Strengthen your local economy"
                ],
                "keywords": [
                    "eco",
                    "organic"
                ]
            },
            "page": "https://northlandnaturals.nz/csa"
        },
        {
            "textsWithKeyWords": {
                "text": [
                    "matt@northlandnaturals.nz "
                ],
                "keywords": [
                    "natural"
                ]
            },
            "page": "https://northlandnaturals.nz/seedlings"
        },
        {
            "textsWithKeyWords": {
                "text": [
                    "Northland Naturals makes fresh, affordable, organic produce available throughout Northern New Zealand. This includes field and greenhouse-grown microgreens, vegetables, and fruit and nut tree crops. You can purchase our produce at the Whangarei Growers’ Market, Huanui Fresh"
                ],
                "keywords": [
                    "green",
                    "natural",
                    "organic"
                ]
            },
            "page": "https://northlandnaturals.nz"
        }
    ],
    [
        "northlandnaturals.nz",
        "1",
        "Agriculture",
        "123",
        "Vegetable Growing (Outdoors)"
    ],
    [
        {
            "textsWithKeyWords": {
                "text": [
                    "If the turf dries out at this stage, some browning of the leaf will occur.  This recovers quickly if kept watered. The establishment watering phase is very important, both to cool and hydrate your lawn.",
                    "Couch Grass provides a beautiful fine leaf, hard wearing lawn, that mows to a carpet like finish.  Low water use, it is tough and holds together exceptionally well, making an ideal choice for high traffic areas. From commercial projects such as school sports grounds and childcare centres to residential lawns for your family and pets enjoyment.  Or simply a green oasis at your beach house just to sit back and admire!",
                    "In warmer regions and coastal areas it will remain green year round.  In winter due to colder temperatures, Couch Grass goes into natural dormancy.  If hit by a frost it turns straw coloured and loses it colour for approximately 2 months.  Your couch will quickly bounce back and green up come spring almost before your eyes – trust us we know because we have a Couch Lawn out front ourselves!",
                    "A good NPK slow release fertiliser should be applied in Spring.  This will encourage green up and repair any damage over the early Summer months.",
                    "Couch is the variety of grass and is known for its' characteristic of having a natural interlocking weave, which provides strength while staying soft and spongy underfoot.",
                    "In warmer regions and coastal areas it will remain green year round.  In winter due to colder temperatures, Couch Grass goes into natural dormancy.  If hit by a frost it turns straw coloured and loses it colour for approximately 2 months.  Your couch will quickly bounce back and green up come spring almost before your eyes – trust us we know because we have a Couch Lawn out front ourselves!",
                    "Couch should not need mowing from approximately June to August, this due to its natural winter dormancy.  Mowing during this period will remove leaf that will not be replaced until Spring.  This opens the surface to excessive wear and weed invasion."
                ],
                "keywords": [
                    "eco",
                    "green",
                    "natural"
                ]
            },
            "page": "https://www.myturf.co.nz/couch-grass/couch-grass/"
        },
        {
            "textsWithKeyWords": {
                "text": [
                    "Tall Fescue Seconds Sold Out ",
                    "Second Grade Now Available  LIMITED SUPPLY Sept 2021",
                    "We hope you are enjoying your green space no matter what the weather!",
                    "In the Winter months - in warmer regions and coastal areas Couch Grass will remain green all year round.  In Winter due to colder temperatures, Couch Grass goes into natural dormancy.  If hit by a frost it turns straw coloured and loses it colour for approximately 2 months.  Your couch will quickly bounce back and green up come Spring before your eyes!"
                ],
                "keywords": [
                    "eco",
                    "green",
                    "natural"
                ]
            },
            "page": "https://www.myturf.co.nz/index.php/download_file/view/113/114/"
        },
        {
            "textsWithKeyWords": {
                "text": [
                    "*Seconds have foreign grass in the Tall Fescue, supplied rolls are fragile and may come in pieces, ideal for small DIY lawns.",
                    "Dark green colour - instant appealing  lush looking grass",
                    "Second Grade  SOLD OUT"
                ],
                "keywords": [
                    "eco",
                    "green"
                ]
            },
            "page": "https://www.myturf.co.nz/couch-grass/other-varieties/"
        },
        {
            "textsWithKeyWords": {
                "text": [
                    "In 2008 we become fully locally owned and operated, Maddison Turf Care grew Legend Couch grass under licence to Strathayr Farms Australia. Changes in 2015 has seen the Turf Farm under redevelopment in grass varieties with Tall Fescue being our major grass variety along with some Couch.  Tall Fescue is now ready and selling from May 2016. Due to demand we set up a new Turf Farm just down the road and are currently harvesting from this in 2017. ",
                    "Let us help assist you to step outside – breathe the fresh air and enjoy the outdoors no matter how big or small your green space is. "
                ],
                "keywords": [
                    "eco",
                    "green"
                ]
            },
            "page": "https://www.myturf.co.nz/about-us/"
        },
        {
            "textsWithKeyWords": {
                "text": [
                    "\"We recently had our lawn relaid using Legend Couch grass at our 12th Avenue property. We used Shane Maddison who supplied us with the grass and helped with the preparation. His service and assistance is outstanding and his back up service to be recommended. Nothing seems to be too much of a problem for Shane and my wife and I recommend his product and service highly\".",
                    "It's looking like a bowling green THANK YOU."
                ],
                "keywords": [
                    "eco",
                    "green"
                ]
            },
            "page": "https://www.myturf.co.nz/testimonials/"
        },
        {
            "textsWithKeyWords": {
                "text": [
                    "Tall Fescue Second Grade SOLD OUT   Retail $10.00+GST per sqm Pick Up"
                ],
                "keywords": [
                    "eco"
                ]
            },
            "page": "https://www.myturf.co.nz/index.php/download_file/view/113/1/"
        },
        {
            "textsWithKeyWords": {
                "text": [],
                "keywords": [
                    "eco"
                ]
            },
            "page": "https://www.myturf.co.nz/index.php/download_file/view/107/1/"
        },
        {
            "textsWithKeyWords": {
                "text": [],
                "keywords": [
                    "eco",
                    "green",
                    "natural"
                ]
            },
            "page": "https://www.myturf.co.nz/"
        },
        {
            "textsWithKeyWords": {
                "text": [],
                "keywords": [
                    "eco",
                    "green",
                    "natural"
                ]
            },
            "page": "https://www.myturf.co.nz#zoomImage448"
        }
    ],
    [
        "www.myturf.co.nz",
        "1",
        "Agriculture",
        "113",
        "Turf Growing"
    ],
    [
        {
            "textsWithKeyWords": {
                "text": [
                    "Laughing Pūkeko Organics grows organic veggies & raises a small flock of hens on 1/2 acre of certified organic farmland."
                ],
                "keywords": [
                    "organic"
                ]
            },
            "page": "https://www.laughingpukeko.co.nz#content"
        }
    ],
    [
        "www.laughingpukeko.co.nz",
        "1",
        "Agriculture",
        "123",
        "Vegetable Growing (Outdoors)"
    ],
    [
        {
            "textsWithKeyWords": {
                "text": [
                    "We live on the farm with our three kids and we eat our own greens every day.",
                    "Better greens.",
                    "We grow fresh greens years round in our hydroponic greenhouses, producing more with less.",
                    "Our climate, and our hydroponic greenhouse setup means we can grow fresh produce year round."
                ],
                "keywords": [
                    "green"
                ]
            },
            "page": "https://www.waikawafresh.co.nz"
        }
    ],
    [
        "www.waikawafresh.co.nz",
        "1",
        "Agriculture",
        "123",
        "Vegetable Growing (Outdoors)"
    ],
    [
        {
            "textsWithKeyWords": {
                "text": [
                    "Become a Stockist",
                    "Become a Stockist",
                    "Become a Stockist",
                    "Goodness comes in many forms and at Lawson’s True Earth, it starts with the soil and ours is special. In the heart of sunny Hawke’s Bay on Ngatarawa Road, our farm was originally a grazing property, with a history of natural farming. In 1992 we established our first organic plantings on these mineral rich soils, with BioGro-certification in 1994. In 2003 we harvested our first blueberries. The results in the quality and flavour of our produce were immediate.",
                    "We’ve been growing delicious, organic blueberries on our Hawke’s Bay family farm for almost 20 years. Every day, we do everything we can to ensure they’re full of true, blue goodness in the way they’re grown, harvested, cared for and shared.",
                    "Goodness comes in many forms and at Lawson’s True Earth, it starts with the soil and ours is special. In the heart of sunny Hawke’s Bay on Ngatarawa Road, our farm was originally a grazing property, with a history of natural farming. In 1992 we established our first organic plantings on these mineral rich soils, with BioGro-certification in 1994. In 2003 we harvested our first blueberries. The results in the quality and flavour of our produce were immediate.",
                    "Growing up in Hawke’s Bay, Scott Lawson spent his youth dabbling in growing vegetables. A quick trip home from school at lunchtime to check on his crops was just part of what he loved to do. So, with over thirty seasons of growing under his belt – his innovation and passion for growing and enjoying a healthy sustainable lifestyle is the driving force behind True Earth certified organic blueberries. Scott has always felt it is important to give back to the community and has been actively involved in many off farm, farming groups. He is currently on the boards of OANZ (Organic Aotearoa New Zealand) and the Hawke’s Bay Future Farming Trust.",
                    "Growing up in Hawke’s Bay, Scott Lawson spent his youth dabbling in growing vegetables. A quick trip home from school at lunchtime to check on his crops was just part of what he loved to do. So, with over thirty seasons of growing under his belt – his innovation and passion for growing and enjoying a healthy sustainable lifestyle is the driving force behind True Earth certified organic blueberries. Scott has always felt it is important to give back to the community and has been actively involved in many off farm, farming groups. He is currently on the boards of OANZ (Organic Aotearoa New Zealand) and the Hawke’s Bay Future Farming Trust."
                ],
                "keywords": [
                    "eco",
                    "natural",
                    "organic",
                    "sustainable"
                ]
            },
            "page": "https://www.trueearth.co.nz#content"
        }
    ],
    [
        "www.trueearth.co.nz",
        "1",
        "Agriculture",
        "123",
        "Vegetable Growing (Outdoors)"
    ],
    [
        {
            "textsWithKeyWords": {
                "text": [
                    "The company’s ability to offer its customers great deals on a wide variety of products has been one of the factors that has contributed to its success. Through its team of experienced buyers, Catch has been able to find the best possible deals from various suppliers. This has allowed the company to become a go-to source for bargain hunters.",
                    "Net sales grew at a robust pace of 38% to reach a record high of $6.3 million in Q3FY18, helped by robust growth in international markets."
                ],
                "keywords": [
                    "eco"
                ]
            },
            "page": "https://www.burntspur.co.nz/author/admin/"
        },
        {
            "textsWithKeyWords": {
                "text": [],
                "keywords": [
                    "eco"
                ]
            },
            "page": "https://www.burntspur.co.nz/category/business/"
        },
        {
            "textsWithKeyWords": {
                "text": [],
                "keywords": [
                    "eco"
                ]
            },
            "page": "https://www.burntspur.co.nz/cettire-sees-lots-of-room-for-growth/"
        },
        {
            "textsWithKeyWords": {
                "text": [],
                "keywords": [
                    "eco"
                ]
            },
            "page": "https://www.burntspur.co.nz/cettire-sees-lots-of-room-for-growth/#respond"
        },
        {
            "textsWithKeyWords": {
                "text": [],
                "keywords": [
                    "eco"
                ]
            },
            "page": "https://www.burntspur.co.nz#main"
        }
    ],
    [
        "www.burntspur.co.nz",
        "1",
        "Agriculture",
        "131",
        "Grape Growing"
    ],
    [
        {
            "textsWithKeyWords": {
                "text": [
                    "The removal of chemical and synthetic inputs to allow the natural fertilisers of soil (microbes and worms) to form relationships with plant roots",
                    "We know we have many collaborations to form to begin to build a seed network that works economically for growers, that aligns with our kaupapa and that adapts alongside the whenua. We intend toward the practise of more localised seed use, saving and sharing in our maara kai.",
                    "Healthy soil full of life is the starting point for growing healthy produce. Regeneratively managed landscapes can act as carbon sinks and retain more rainwater by restoring the natural cycles of carbon, water, and nitrogen.",
                    "We are currently working through a three year process to become Hua Parakore certified grower. This is a holistic kaupapa Māori framework for certifing Kai Atua - pure foods free from GMO's, pesticides and synthetic fertilizers.",
                    "We all know that we need to move away from industrialised monocrop and chemical dependent food systems. At Vagabond Vege, we look at agriculture through a different lens. We believe that through collaborative networks of local small scale farms, who have diversity and ecosystem health as a cornerstone of their practice, we can create a more resilient food system.",
                    "The soil is alive. Teeming with billions of microbes and insects that build and maintain the soil ecosystem. They need constant feeding, which is the role of the plant roots. By providing a diverse set of plant roots year round we can build and maintain a robust population of micro-organisms. We try to have multi species growing at once in each bed and rotate species between the beds during the season."
                ],
                "keywords": [
                    "eco",
                    "natural"
                ]
            },
            "page": "https://www.vagabondvege.nz/our-practice"
        },
        {
            "textsWithKeyWords": {
                "text": [
                    "The CSA model generates the support required for a small farm like us to be sustainable. It also means resilience in the sense of local self-sufficiency, meaning we are not at the whim of long overseas supply chains. For us, resilience is knowing we are backed despite events that are out of our control. If a sudden hail storm takes out part of the eggplant crop, everyone is disappointed together, and together we share the abundance of a crop that did very well that year.\n",
                    "In the age of the supermarket, it is hard to know where our kai comes from, who grew it and what’s actually in it. Farmers have been pushed into industrial monocropping because that is deemed the only economically viable way to grow food. We want to be part of the change towards a diverse network of small regenerative farms.\n",
                    "Salad mix, cooking greens and 5-7 other seasonal vegetables",
                    "Salad mix, cooking greens and 7-10 other seasonal vegetables",
                    "CSA stands for Community Supported Agriculture. It’s a partnership between awesome people like you, and small sustainable farms like us, that ensures prosperity for both parties. As a CSA member, your financial contribution and commitment gives us the stability and security to cover the costs of growing. In return you will receive a share of the seasonal harvest - this is why we call them CSA Shares."
                ],
                "keywords": [
                    "eco",
                    "green",
                    "sustainable"
                ]
            },
            "page": "https://www.vagabondvege.nz/csa"
        },
        {
            "textsWithKeyWords": {
                "text": [
                    "Regenerative, sustainable and bountiful gardens are not just for commercial growers. We want to see as many thriving home gardens as possible. Supplementing the weekly meals, or providing the bulk, it doesn't matter. Get the most out of your home garden next year - or start a new one, and enjoy the benefits of fresh homegrown food.",
                    "Polycropping is a simple way to get more growing in a small space. It also has many benefits for the soil and ecology of your garden. Come along to learn how it works, and see some simple planting guilds in action.",
                    "Home Grown Microgreens - June 11th (10am-12pm)"
                ],
                "keywords": [
                    "eco",
                    "green",
                    "sustainable"
                ]
            },
            "page": "https://www.vagabondvege.nz/workshops"
        },
        {
            "textsWithKeyWords": {
                "text": [
                    "Become a member of our CSA community and recieve a weekly share of the farm harvest.",
                    "We use agroecological principles to farm the land and produce high quality, nutrient dense food."
                ],
                "keywords": [
                    "eco"
                ]
            },
            "page": "https://www.vagabondvege.nz#VALUES"
        },
        {
            "textsWithKeyWords": {
                "text": [],
                "keywords": [
                    "eco"
                ]
            },
            "page": "https://www.vagabondvege.nz/"
        }
    ],
    [
        "www.vagabondvege.nz",
        "1",
        "Agriculture",
        "123",
        "Vegetable Growing (Outdoors)"
    ],
    [
        {
            "textsWithKeyWords": {
                "text": [
                    "Recommending the use of specialized products, such as pesticides, fertilizers"
                ],
                "keywords": [
                    "eco"
                ]
            },
            "page": "https://www.grapevision.co.nz/development"
        },
        {
            "textsWithKeyWords": {
                "text": [
                    "We manage vineyards for absentee owners and locally based owners who need assistance with viticulture. We run both conventional and BioGro accredited organic vineyards. We manage the following viticultural activities:"
                ],
                "keywords": [
                    "organic"
                ]
            },
            "page": "https://www.grapevision.co.nz/management"
        },
        {
            "textsWithKeyWords": {
                "text": [
                    "Donald has been with Grape Vision for 3 years, initially starting as a Technical Officer. He is responsible for vineyard management as well as the pest and disease monitoring, yield estimation, compliance and record keeping."
                ],
                "keywords": [
                    "eco"
                ]
            },
            "page": "https://www.grapevision.co.nz/about"
        }
    ],
    [
        "www.grapevision.co.nz",
        "1",
        "Agriculture",
        "131",
        "Grape Growing"
    ]
]