[
    {
        "domain": "https://www.watties.co.nz",
        "quotes": "Summary: The text mentions that the cans used for the products are 100% recyclable, indicating a commitment to sustainability.\n\nDirect quotes: \n- \"how our cans are 100% recyclable\"",
        "pagesWithKeywords": [
            {
                "textsWithKeyWords": {
                    "text": [
                        "Find out why you should choose our NZ Grown and Plant Based products and how our cans are 100% recyclable. ",
                        "Cans are 100% recyclable "
                    ],
                    "keywords": [
                        "recyclable"
                    ]
                },
                "page": "https://www.watties.co.nz/why-watties/107856300158/3-great-sustainable-choices-from-watties"
            }
        ]
    },
    {
        "domain": "https://www.airnewzealand.co.nz",
        "quotes": "There are no statements related to environmental or sustainability issues in the provided text.\n\nN/A",
        "pagesWithKeywords": [
            {
                "textsWithKeyWords": {
                    "text": [
                        "New Zealand has naturally stunning landscapes, friendly locals and heaps to do - all within short travelling distances."
                    ],
                    "keywords": [
                        "natural"
                    ]
                },
                "page": "https://www.airnewzealand.co.nz/destination-new-zealand"
            },
            {
                "textsWithKeyWords": {
                    "text": [
                        "Recognised as America's greenest city, Portland is passionate about treading more lightly on the Earth."
                    ],
                    "keywords": [
                        "green"
                    ]
                },
                "page": "https://www.airnewzealand.co.nz/destination-usa"
            },
            {
                "textsWithKeyWords": {
                    "text": [
                        "Spring is a gorgeous time to visit Vancouver. Flowers are blooming, the whales are on the move and the city's people are embracing the joys of warmer weather. You can explore Stanley Park, the green jewel of inner-city Vancouver. Or catch a floatplane to Vancouver Island for walks around historic Victoria, followed by a Cowichan Valley wine tour. It's always a great time to head up to Grouse Mountain for sky-high views and bear photos. You can also throw in a road or train trip to the Rockies for good measure. Another popular attraction is the FlyOver Canada virtual flightseeing tour that delights passengers of all ages."
                    ],
                    "keywords": [
                        "green"
                    ]
                },
                "page": "https://www.airnewzealand.co.nz/destination-vancouver"
            },
            {
                "textsWithKeyWords": {
                    "text": [
                        "Savour exciting Hong Kong's varied and contrasting delights, from natural splendour to vivacious nightlife."
                    ],
                    "keywords": [
                        "natural"
                    ]
                },
                "page": "https://www.airnewzealand.co.nz/destination-asia"
            }
        ]
    },
    {
        "domain": "https://www.bunnings.co.nz",
        "quotes": "Summary: The text does not contain any direct statements related to environmental or sustainability issues.\n\nQuotes: N/A",
        "pagesWithKeywords": [
            {
                "textsWithKeyWords": {
                    "text": [
                        "We've got the D.I.Y. Advice and range to help bring out your inner green thumb"
                    ],
                    "keywords": [
                        "green"
                    ]
                },
                "page": "https://www.bunnings.co.nz/products/garden"
            }
        ]
    },
    {
        "domain": "https://www.hallensteins.com",
        "quotes": "The text mentions the use of organic cotton, which is certified by an independent third party, and the traceability of flax used in their linen range to ensure the environment is respected at every step of the process. \n\nDirect quotes: \n- \"At Hallenstein Brothers we use Asiatic cotton and Organic Cotton which is certified by an independent third party.\"\n- \"Traceability ensures the environment, as well as the producers, are respected at every step of the process.\"",
        "pagesWithKeywords": [
            {
                "textsWithKeyWords": {
                    "text": [
                        "\n\t\t\t\t\t\t\t\tCotton is a natural fibre that is used across our range of clothing in a variety of ways. Cotton is spun into yarn that can be woven into a soft and durable fabric. At Hallenstein Brothers we use Asiatic cotton and Organic Cotton which is certified by an independent third party. Cotton can be woven in a variety of ways to create every day fabrics for you to enjoy, including corduroy, denim, velour and fleece. Cotton is normally easy to care for through machine washing and hang drying but refer to care instructions to ensure the longevity of your garments.\t\t\t\t\t\t\t",
                        "\n\t\t\t\t\t\t\t\tLinen is a natural fibre derived from flax. Lightweight and breathable, it is generally worn through the warmer months through shirting and tailoring. Made in a way we’re proud of, our Linen Range is crafted from traceable flax produced exclusively in France, Belgium or the Netherlands. Traceability ensures the environment, as well as the producers, are respected at every step of the process. Our new range brings updated styling and soft yet durable wear. Great for any season, linen is a natural fibre that drapes nicely through pants and shirting which are perfect for both casual and formal wear. \t\t\t\t\t\t\t"
                    ],
                    "keywords": [
                        "natural"
                    ]
                },
                "page": "https://www.hallensteins.com/faqs"
            }
        ]
    },
    {
        "domain": "https://www.watties.co.nz",
        "quotes": "Summary: The text mentions that Wattie's cans are recyclable, indicating a concern for environmental sustainability. \n\nDirect quotes: \n- \"Yes, all of our cans are recyclable.\" \n- (No direct quote, but the mention of recyclability implies a concern for environmental sustainability.)",
        "pagesWithKeywords": [
            {
                "textsWithKeyWords": {
                    "text": [
                        " To stop our content appearing organically in your newsfeed, you must unlike our Facebook page.",
                        "Facebook delivers content from a brand page to its users’ newsfeeds in two ways: organically to those who have chosen to ‘like’ the page, and through advertising."
                    ],
                    "keywords": [
                        "organic"
                    ]
                },
                "page": "https://www.watties.co.nz/terms-of-use"
            },
            {
                "textsWithKeyWords": {
                    "text": [
                        "Are Wattie’s cans recyclable?",
                        "Yes, all of our cans are recyclable."
                    ],
                    "keywords": [
                        "recyclable"
                    ]
                },
                "page": "https://www.watties.co.nz/faqs"
            }
        ]
    },
    {
        "domain": "https://www.burgerfuel.com",
        "quotes": "There are no statements related to environmental or sustainability issues in the provided text.",
        "pagesWithKeywords": [
            {
                "textsWithKeyWords": {
                    "text": [
                        "Fresh natural aioli. Just another taste. Just another hit. Addiction made daily. ​",
                        "You deserve nothing less than the best. That's why we leave no stone unturned in our relentless quest for the freshest, most pure, natural ingredients we can get our hands on. It's also why we make sure that your meal is made to order, when you order, and prepared with the utmost care, preparation, and burger making respect.",
                        "Our sweet, tomato relish is crafted using whole fresh fruit and vegetables, selected herbs and natural spices. Naturally sweet and aged to perfection.",
                        "Batch brewed tomato relish, naturally aged so the acid drops and the sweetness hops.",
                        "Our chicken is the real deal - we never use fillers and it must be ethically raised. That's why we serve only 100% free range natural chicken breast - and say no to processing, hormones, additives, and GMO's."
                    ],
                    "keywords": [
                        "natural"
                    ]
                },
                "page": "https://www.burgerfuel.com/nz/our-food/pure-ingredients"
            },
            {
                "textsWithKeyWords": {
                    "text": [
                        "In the midst of our conversion into the digital era, we sometimes find ourselves on the edge of the fence, gazing over the paddocks trying to determine which grass is greener. The digital era ..."
                    ],
                    "keywords": [
                        "green"
                    ]
                },
                "page": "https://www.burgerfuel.com#mm-2"
            },
            {
                "textsWithKeyWords": {
                    "text": [
                        "All-natural BurgerFuel Thickshakes made fresh to order."
                    ],
                    "keywords": [
                        "natural"
                    ]
                },
                "page": "https://www.burgerfuel.com/nz/our-food/burgers"
            },
            {
                "textsWithKeyWords": {
                    "text": [
                        "You are an organic machine, a sensational human and your engine deserves the most pure, natural ingredients, ripped straight from mother natures sweet bosom before anyone's had the chance to defile them. Our super natural gourmet burgers are made to be eaten with pure, unadulterated, unbridled passion (there's no time for knives and forks here... but we're always down for a spoon, if you're offering) and every mouthful should be a celebration of the most beautiful things in life, like pure fuel and your bad assery."
                    ],
                    "keywords": [
                        "natural",
                        "organic"
                    ]
                },
                "page": "https://www.burgerfuel.com/nz/our-food/fuel-for-the-human-engine"
            }
        ]
    },
    {
        "domain": "https://www.myfoodbag.co.nz",
        "quotes": "The text contains several statements related to environmental and sustainability issues. The first statement mentions \"sustainable packaging and ingredients,\" while the second statement highlights the lower greenhouse gas emissions of meal kits compared to supermarket-bought meals. The third statement talks about the company's efforts to monitor and reduce their greenhouse gas emissions and operational waste. The fourth statement emphasizes the role of Kiwi kids in shaping a sustainable New Zealand. Finally, the fifth statement mentions the company's continuous efforts to improve their packaging to reduce landfill and introduce recyclable alternatives.\n\nDirect quotes:\n- \"Great recipes, good choice and sustainable packaging and ingredients.\"\n- \"Research shows meal kits have lower average greenhouse gas emissions than supermarket-bought meals*.\"\n- \"Through innovative ideas and strong partnerships we are working to comprehensively monitor and reduce our greenhouse gas emissions and operational waste.\"\n- \"We currently have the 3rd highest rate of obesity in the OECD and Kiwi kids play a critical role in how we shape a sustainable New Zealand.\"\n- \"",
        "pagesWithKeywords": [
            {
                "textsWithKeyWords": {
                    "text": [
                        "We're continuously reviewing and improving our packaging to ensure we reduce landfill and introduce recyclable alternatives, without compromising food quality and safety.",
                        "Research shows meal kits have lower average greenhouse gas emissions than supermarket-bought meals*.",
                        "Through innovative ideas and strong partnerships we are working to comprehensively monitor and reduce our greenhouse gas emissions and operational waste.",
                        "Our boxes are made of 47% recycled cardboard & FSC certified virgin cardboard, MADE trays composed of 80% recycled plastic, and our ice packs are 100% water."
                    ],
                    "keywords": [
                        "green",
                        "recyclable",
                        "recycled"
                    ]
                },
                "page": "https://www.myfoodbag.co.nz/sustainability"
            },
            {
                "textsWithKeyWords": {
                    "text": [
                        "Great recipes, good choice and sustainable packaging and ingredients.  "
                    ],
                    "keywords": [
                        "sustainable"
                    ]
                },
                "page": "https://www.myfoodbag.co.nz#"
            },
            {
                "textsWithKeyWords": {
                    "text": [
                        "We currently have the 3rd highest rate of obesity in the OECD and Kiwi kids play a critical role in how we shape a sustainable New Zealand."
                    ],
                    "keywords": [
                        "sustainable"
                    ]
                },
                "page": "https://www.myfoodbag.co.nz/garden-to-table"
            }
        ]
    },
    {
        "domain": "https://hellpizza.nz",
        "quotes": "Statements related to environmental or sustainability issues:\n- HELL is proactive in creating a sustainable future.\n- Carbon emissions created by HELL are offset by purchasing high-quality carbon credits.\n- HELL has recyclable and compostable packaging options.\n- HELL carefully selects suppliers who share their values for ethics and sustainability.\n- HELL's delivery vehicles are electric and their boxes are made from recycled fibres.\n- HELL is working to reduce waste going to landfills and choosing recycled materials where possible.\n- HELL is committed to leading the way in the food sector for sustainability.\n- HELL plans to measure and record the sustainability of their suppliers and producers.\n- HELL is a market leader in sourcing sustainable food.\n- HELL has worked with Love NZ to ensure their boxes can be recycled throughout NZ.\n- HELL explores cleaner, greener ways to do business.\n\nDirect quotes:\n- \"We want to be proactive in creating a sustainable future.\"\n- \"Any carbon emissions created by HELL are",
        "pagesWithKeywords": [
            {
                "textsWithKeyWords": {
                    "text": [
                        "We make more than 50,000 pizzas each week for hungry Kiwis, using a significant quantity of food in the process. In addition, the production and transportation of raw ingredients uses a significant amount of natural resources.",
                        "HELL is a market leader when it comes to sourcing sustainable food and was one of the first to go free-range and prioritise sustainability in our supply chain. That's why more than 86% of our products are locally sourced and produced.",
                        "Any carbon emissions created by HELL are offset by purchasing high-quality carbon credits, which are used in the regeneration and conservation of native forests, creating a greener, happier world that even the Master approves of.",
                        "HELL relies on a workforce of dedicated, positive, skilled people – from our head office to our franchisees and store staff. To have a sustainable future we need to keep our team happy, safe and have a pipeline of new people keen to work with us. HELL prides itself on being a locally owned and operated business, and we are keen to support the communities we operate in and empower our staff to play a role in this.",
                        "Wherever possible, we carefully select suppliers who share our values for ethics and sustainability (e.g., our pizzas are free-range).  We proactively seek out new sustainable food options (e.g. alternative proteins), so we have accessible, delicious products our customers can experiment with – incorporating greener choices into their diets at their own pace.",
                        "HELL’s delivery vehicles are electric - silently delivering hot, tasty, and sustainable treats in boxes made locally from recycled fibres (and looking damn good while they do it).",
                        "We’re working to  reduce the amount of waste going to our landfills, and the natural resources that are only used once, by choosing recycled materials where possible. Currently 98.6% of our packaging is recyclable, and 96% is made from recycled fibres. We also choose to buy locally made materials wherever possible to reduce our transport and freight footprint.",
                        "We also plan to measure and record how “good” each of our suppliers and producers of food are. This will help us make more informed choices on who to partner with – ultimately influencing our own sustainable pathway by encouraging suppliers to produce their food in more environmentally efficient ways."
                    ],
                    "keywords": [
                        "green",
                        "natural",
                        "recyclable",
                        "recycled",
                        "sustainable"
                    ]
                },
                "page": "https://hellpizza.nz/wickedpedia/2021/09/28/sustainability-plan"
            },
            {
                "textsWithKeyWords": {
                    "text": [
                        "The foil we use for pasta and ribs is recyclable, but not everywhere in New Zealand, so we’re working on that with Love NZ!",
                        "98.6% of our packaging is recyclable, and 96% is made from recycled fibres. ",
                        "We have worked with the Public Place Recycling Scheme (Love NZ) to ensure that our boxes can be recycled throughout NZ.",
                        "We also have two paper sides bags that are recyclable and made from recycled fibre, and we’ve replaced our plastic bags with compostable eco bags."
                    ],
                    "keywords": [
                        "compostable",
                        "recyclable",
                        "recycled"
                    ]
                },
                "page": "https://hellpizza.nz/wickedpedia/2019/05/01/responsible-earth"
            },
            {
                "textsWithKeyWords": {
                    "text": [
                        "We want to be proactive in creating a sustainable future. Our deliveries are an obvious producer of carbon. Ideally, they would be emission-free with no need to offset; but until we can practically do that, we’re offsetting each delivery, and won’t be passing the costs onto our loyal customers.",
                        "We’ve always cared about reducing our environmental impact\n- much of our packaging is recycled and recyclable, we offer e-bike delivery in\nsome areas and use local free-range ingredients. ",
                        "HELL is committed to leading the way in our food sector and showing other brands what’s possible when it comes to operating a sustainable food business."
                    ],
                    "keywords": [
                        "recyclable",
                        "recycled",
                        "sustainable"
                    ]
                },
                "page": "https://hellpizza.nz/wickedpedia/2020/08/18/hell-deliveries-go-carbon-neutral"
            },
            {
                "textsWithKeyWords": {
                    "text": [
                        "We have max respect for Mother Nature, and we continue to explore cleaner, greener ways to go about our business."
                    ],
                    "keywords": [
                        "green"
                    ]
                },
                "page": "https://hellpizza.nz/wickedpedia/tags/sustainability"
            },
            {
                "textsWithKeyWords": {
                    "text": [
                        "For Ben Cumming, CEO of HELL Pizza, it was a natural\npartnership."
                    ],
                    "keywords": [
                        "natural"
                    ]
                },
                "page": "https://hellpizza.nz/wickedpedia/2021/04/07/150-youths-graduate-from-active-in-hell-paid-training"
            },
            {
                "textsWithKeyWords": {
                    "text": [
                        "“HELL shares the same\nvalues as us, wanting to create great pizza with quality ingredients. We take\nanimal welfare incredibly seriously, that is why we both insist on knowing\nwhere our meat comes from and that it is environmentally friendly and\nsustainable”."
                    ],
                    "keywords": [
                        "sustainable"
                    ]
                },
                "page": "https://hellpizza.nz/wickedpedia/2019/04/16/hell-free-range"
            },
            {
                "textsWithKeyWords": {
                    "text": [
                        "Freedom to express natural behaviour: by providing sufficient space, proper facilities and the company of the animal’s own kind."
                    ],
                    "keywords": [
                        "natural"
                    ]
                },
                "page": "https://hellpizza.nz/wickedpedia/2015/10/15/hell-pizzas-pleasure"
            },
            {
                "textsWithKeyWords": {
                    "text": [],
                    "keywords": [
                        "green"
                    ]
                },
                "page": "https://hellpizza.nz/assets/pdfs/menu/menu-web-01-23.pdf"
            }
        ]
    },
    {
        "domain": "https://www.airnewzealand.co.nz",
        "quotes": "The text mentions Portland as being recognized as America's greenest city, indicating a focus on sustainability and environmental issues. \n\nDirect quotes: \n- \"Recognised as America's greenest city, Portland is passionate about treading more lightly on the Earth.\"",
        "pagesWithKeywords": [
            {
                "textsWithKeyWords": {
                    "text": [
                        "New Zealand has naturally stunning landscapes, friendly locals and heaps to do - all within short travelling distances."
                    ],
                    "keywords": [
                        "natural"
                    ]
                },
                "page": "https://www.airnewzealand.co.nz/destination-new-zealand"
            },
            {
                "textsWithKeyWords": {
                    "text": [
                        "Recognised as America's greenest city, Portland is passionate about treading more lightly on the Earth."
                    ],
                    "keywords": [
                        "green"
                    ]
                },
                "page": "https://www.airnewzealand.co.nz/destination-usa"
            },
            {
                "textsWithKeyWords": {
                    "text": [
                        "Spring is a gorgeous time to visit Vancouver. Flowers are blooming, the whales are on the move and the city's people are embracing the joys of warmer weather. You can explore Stanley Park, the green jewel of inner-city Vancouver. Or catch a floatplane to Vancouver Island for walks around historic Victoria, followed by a Cowichan Valley wine tour. It's always a great time to head up to Grouse Mountain for sky-high views and bear photos. You can also throw in a road or train trip to the Rockies for good measure. Another popular attraction is the FlyOver Canada virtual flightseeing tour that delights passengers of all ages."
                    ],
                    "keywords": [
                        "green"
                    ]
                },
                "page": "https://www.airnewzealand.co.nz/destination-vancouver"
            },
            {
                "textsWithKeyWords": {
                    "text": [
                        "Savour exciting Hong Kong's varied and contrasting delights, from natural splendour to vivacious nightlife."
                    ],
                    "keywords": [
                        "natural"
                    ]
                },
                "page": "https://www.airnewzealand.co.nz/destination-asia"
            }
        ]
    },
    {
        "domain": "https://www.bunnings.co.nz",
        "quotes": "Summary: The text does not contain any direct statements related to environmental or sustainability issues.\n\nQuotes: N/A",
        "pagesWithKeywords": [
            {
                "textsWithKeyWords": {
                    "text": [
                        "We've got the D.I.Y. Advice and range to help bring out your inner green thumb"
                    ],
                    "keywords": [
                        "green"
                    ]
                },
                "page": "https://www.bunnings.co.nz/products/garden"
            }
        ]
    },
    {
        "domain": "https://hellpizza.nz",
        "quotes": "Summary: The text mentions the company's respect for the environment and their efforts to find more sustainable ways of conducting their business.\n\nDirect quotes: \"We have max respect for Mother Nature\" and \"we continue to explore cleaner, greener ways to go about our business.\"",
        "pagesWithKeywords": [
            {
                "textsWithKeyWords": {
                    "text": [
                        "We have max respect for Mother Nature, and we continue to explore cleaner, greener ways to go about our business."
                    ],
                    "keywords": [
                        "green"
                    ]
                },
                "page": "https://hellpizza.nz/wickedpedia/tags/sustainability"
            },
            {
                "textsWithKeyWords": {
                    "text": [],
                    "keywords": [
                        "green"
                    ]
                },
                "page": "https://hellpizza.nz/assets/pdfs/menu/menu-web-01-23.pdf"
            }
        ]
    },
    {
        "domain": "https://www.watties.co.nz",
        "quotes": "The statement \"Yes, all of our cans are recyclable\" indicates that the company is addressing environmental and sustainability issues by ensuring that their product packaging can be recycled. \n\nDirect quotes: \n- \"Yes, all of our cans are recyclable.\"",
        "pagesWithKeywords": [
            {
                "textsWithKeyWords": {
                    "text": [
                        " To stop our content appearing organically in your newsfeed, you must unlike our Facebook page.",
                        "Facebook delivers content from a brand page to its users’ newsfeeds in two ways: organically to those who have chosen to ‘like’ the page, and through advertising."
                    ],
                    "keywords": [
                        "organic"
                    ]
                },
                "page": "https://www.watties.co.nz/terms-of-use"
            },
            {
                "textsWithKeyWords": {
                    "text": [
                        "Yes, all of our cans are recyclable.",
                        "Are Wattie’s cans recyclable?"
                    ],
                    "keywords": [
                        "recyclable"
                    ]
                },
                "page": "https://www.watties.co.nz/faqs"
            }
        ]
    },
    {
        "domain": "https://www.myfoodbag.co.nz",
        "quotes": "Statements related to environmental or sustainability issues:\n- Meal kits have lower greenhouse gas emissions than supermarket-bought meals.\n- The company is working to monitor and reduce their greenhouse gas emissions and operational waste.\n- Kiwi kids play a critical role in shaping a sustainable New Zealand.\n- The company is continuously improving their packaging to reduce landfill and introduce recyclable alternatives.\n- The company uses sustainable packaging and ingredients.\n\nDirect quotes to support the summary:\n- \"Research shows meal kits have lower average greenhouse gas emissions than supermarket-bought meals*.\"\n- \"Through innovative ideas and strong partnerships we are working to comprehensively monitor and reduce our greenhouse gas emissions and operational waste.\"\n- \"We currently have the 3rd highest rate of obesity in the OECD and Kiwi kids play a critical role in how we shape a sustainable New Zealand.\"\n- \"We're continuously reviewing and improving our packaging to ensure we reduce landfill and introduce recyclable alternatives, without compromising food quality and safety.\"\n- \"Great recipes, good choice and",
        "pagesWithKeywords": [
            {
                "textsWithKeyWords": {
                    "text": [
                        "Research shows meal kits have lower average greenhouse gas emissions than supermarket-bought meals*.",
                        "Our boxes are made of 47% recycled cardboard & FSC certified virgin cardboard, MADE trays composed of 80% recycled plastic, and our ice packs are 100% water.",
                        "We're continuously reviewing and improving our packaging to ensure we reduce landfill and introduce recyclable alternatives, without compromising food quality and safety.",
                        "Through innovative ideas and strong partnerships we are working to comprehensively monitor and reduce our greenhouse gas emissions and operational waste."
                    ],
                    "keywords": [
                        "green",
                        "recyclable",
                        "recycled"
                    ]
                },
                "page": "https://www.myfoodbag.co.nz/sustainability"
            },
            {
                "textsWithKeyWords": {
                    "text": [
                        "Great recipes, good choice and sustainable packaging and ingredients.  "
                    ],
                    "keywords": [
                        "sustainable"
                    ]
                },
                "page": "https://www.myfoodbag.co.nz#"
            },
            {
                "textsWithKeyWords": {
                    "text": [
                        "We currently have the 3rd highest rate of obesity in the OECD and Kiwi kids play a critical role in how we shape a sustainable New Zealand."
                    ],
                    "keywords": [
                        "sustainable"
                    ]
                },
                "page": "https://www.myfoodbag.co.nz/garden-to-table"
            }
        ]
    },
    {
        "domain": "https://www.burgerfuel.com",
        "quotes": "The text emphasizes the use of natural and ethically sourced ingredients in their food. There is no direct mention of environmental or sustainability issues.\n\nDirect quotes:\n- \"Our sweet, tomato relish is crafted using whole fresh fruit and vegetables, selected herbs and natural spices. Naturally sweet and aged to perfection.\"\n- \"Our chicken is the real deal - we never use fillers and it must be ethically raised. That's why we serve only 100% free range natural chicken breast - and say no to processing, hormones, additives, and GMO's.\"\n- \"Batch brewed tomato relish, naturally aged so the acid drops and the sweetness hops.\"\n- \"Soy thickshakes made with all-natural BurgerFuel Whip\"\n- \"Fresh natural aioli. Just another taste. Just another hit. Addiction made daily.\"\n- \"All-natural BurgerFuel Thickshakes made fresh to order.\"\n- \"You are an organic machine, a sensational human and your engine deserves the most pure, natural",
        "pagesWithKeywords": [
            {
                "textsWithKeyWords": {
                    "text": [
                        "Our sweet, tomato relish is crafted using whole fresh fruit and vegetables, selected herbs and natural spices. Naturally sweet and aged to perfection.",
                        "Our chicken is the real deal - we never use fillers and it must be ethically raised. That's why we serve only 100% free range natural chicken breast - and say no to processing, hormones, additives, and GMO's.",
                        "Batch brewed tomato relish, naturally aged so the acid drops and the sweetness hops.",
                        "Fresh natural aioli. Just another taste. Just another hit. Addiction made daily. ​",
                        "You deserve nothing less than the best. That's why we leave no stone unturned in our relentless quest for the freshest, most pure, natural ingredients we can get our hands on. It's also why we make sure that your meal is made to order, when you order, and prepared with the utmost care, preparation, and burger making respect."
                    ],
                    "keywords": [
                        "natural"
                    ]
                },
                "page": "https://www.burgerfuel.com/nz/our-food/pure-ingredients"
            },
            {
                "textsWithKeyWords": {
                    "text": [
                        "Soy thickshakes made with all-natural BurgerFuel Whip",
                        "Milk thickshakes made with all-natural BurgerFuel Whip",
                        "Cheeseburger, spud fries with fresh natural free range BurgerFuel Aioli or tomato sauce and a small juice"
                    ],
                    "keywords": [
                        "natural"
                    ]
                },
                "page": "https://www.burgerfuel.com/nz/order"
            },
            {
                "textsWithKeyWords": {
                    "text": [
                        "In the midst of our conversion into the digital era, we sometimes find ourselves on the edge of the fence, gazing over the paddocks trying to determine which grass is greener. The digital era ..."
                    ],
                    "keywords": [
                        "green"
                    ]
                },
                "page": "https://www.burgerfuel.com#mm-2"
            },
            {
                "textsWithKeyWords": {
                    "text": [
                        "All-natural BurgerFuel Thickshakes made fresh to order."
                    ],
                    "keywords": [
                        "natural"
                    ]
                },
                "page": "https://www.burgerfuel.com/nz/our-food/burgers"
            },
            {
                "textsWithKeyWords": {
                    "text": [
                        "You are an organic machine, a sensational human and your engine deserves the most pure, natural ingredients, ripped straight from mother natures sweet bosom before anyone's had the chance to defile them. Our super natural gourmet burgers are made to be eaten with pure, unadulterated, unbridled passion (there's no time for knives and forks here... but we're always down for a spoon, if you're offering) and every mouthful should be a celebration of the most beautiful things in life, like pure fuel and your bad assery."
                    ],
                    "keywords": [
                        "natural",
                        "organic"
                    ]
                },
                "page": "https://www.burgerfuel.com/nz/our-food/fuel-for-the-human-engine"
            }
        ]
    },
    {
        "domain": "https://www.hallensteins.com",
        "quotes": "There are no statements related to environmental or sustainability issues in the provided text.",
        "pagesWithKeywords": [
            {
                "textsWithKeyWords": {
                    "text": [
                        "\n\t\t\t\t\t\t\t\tLinen is a natural fibre derived from flax. Lightweight and breathable, it is generally worn through the warmer months through shirting and tailoring. Made in a way we’re proud of, our Linen Range is crafted from traceable flax produced exclusively in France, Belgium or the Netherlands. Traceability ensures the environment, as well as the producers, are respected at every step of the process. Our new range brings updated styling and soft yet durable wear. Great for any season, linen is a natural fibre that drapes nicely through pants and shirting which are perfect for both casual and formal wear. \t\t\t\t\t\t\t",
                        "\n\t\t\t\t\t\t\t\tCotton is a natural fibre that is used across our range of clothing in a variety of ways. Cotton is spun into yarn that can be woven into a soft and durable fabric. At Hallenstein Brothers we use Asiatic cotton and Organic Cotton which is certified by an independent third party. Cotton can be woven in a variety of ways to create every day fabrics for you to enjoy, including corduroy, denim, velour and fleece. Cotton is normally easy to care for through machine washing and hang drying but refer to care instructions to ensure the longevity of your garments.\t\t\t\t\t\t\t"
                    ],
                    "keywords": [
                        "natural"
                    ]
                },
                "page": "https://www.hallensteins.com/faqs"
            },
            {
                "textsWithKeyWords": {
                    "text": [
                        "recycled puffer jackets"
                    ],
                    "keywords": [
                        "recycled"
                    ]
                },
                "page": "https://www.hallensteins.com/clothing/jackets-coats/puffer-jackets"
            }
        ]
    },
    {
        "domain": "https://www.bunnings.co.nz",
        "quotes": "Summary: The text does not contain any direct statements related to environmental or sustainability issues.\n\nQuotes: N/A",
        "pagesWithKeywords": [
            {
                "textsWithKeyWords": {
                    "text": [
                        "We've got the D.I.Y. Advice and range to help bring out your inner green thumb"
                    ],
                    "keywords": [
                        "green"
                    ]
                },
                "page": "https://www.bunnings.co.nz/products/garden"
            }
        ]
    },
    {
        "domain": "https://www.watties.co.nz",
        "quotes": "Summary: The text does contain a statement related to environmental/sustainability issues, specifically about the recyclability of Wattie's cans.\n\nDirect quotes: \n- \"Are Wattie's cans recyclable?\" \n- \"Yes, all of our cans are recyclable.\"",
        "pagesWithKeywords": [
            {
                "textsWithKeyWords": {
                    "text": [
                        " To stop our content appearing organically in your newsfeed, you must unlike our Facebook page.",
                        "Facebook delivers content from a brand page to its users’ newsfeeds in two ways: organically to those who have chosen to ‘like’ the page, and through advertising."
                    ],
                    "keywords": [
                        "organic"
                    ]
                },
                "page": "https://www.watties.co.nz/terms-of-use"
            },
            {
                "textsWithKeyWords": {
                    "text": [
                        "Yes, all of our cans are recyclable.",
                        "Are Wattie’s cans recyclable?"
                    ],
                    "keywords": [
                        "recyclable"
                    ]
                },
                "page": "https://www.watties.co.nz/faqs"
            }
        ]
    },
    {
        "domain": "https://www.picspeanutbutter.com",
        "quotes": "The text does not contain any direct statements related to environmental or sustainability issues.\n\nN/A",
        "pagesWithKeywords": [
            {
                "textsWithKeyWords": {
                    "text": [
                        "After a voluntary audit of our supply chain for ethical and sustainable business practices, we’ve decided to stop making our Cashew Butter and we will be removing it from our Pic’s family.",
                        "The growers of these peanuts only produce tiny amounts of organic peanuts which wouldn’t be enough to keep up with our demand. You see, organic peanuts are super tricky to grow. Peanuts need to be sprayed up to 10-12 times a year for pest and fungus (such as aflatoxins) control. However, that doesn’t mean they just spray any old thing on the growing peanuts. Herbicides are limited in volume, frequency, type, and of course, meet NZ food-safe practice codes.",
                        "Being all-natural, a stir with a sturdy knife is vital for your Pic’s. Make sure you deep dive and get all the way to the bottom, otherwise, when the end is near, you will have a dry bottom, which no-one wants.",
                        "Our smooth is remarkably smooth! We don't add any emulsifiers to keep it solid or extra oil to make it runny, it's just the natural oils from the peanuts. It’s velvety and oh so perfect for drizzling, baking, or getting that deliciously delicate layer of nutty butter on your toast."
                    ],
                    "keywords": [
                        "natural",
                        "organic",
                        "sustainable"
                    ]
                },
                "page": "https://www.picspeanutbutter.com/go-to-stories/frequently-asked-questions/"
            }
        ]
    },
    {
        "domain": "https://www.airnewzealand.co.nz",
        "quotes": "The text mentions environmental and sustainability issues in relation to Portland, which is recognized as America's greenest city. \n\nDirect quotes: \"Recognised as America's greenest city, Portland is passionate about treading more lightly on the Earth.\"",
        "pagesWithKeywords": [
            {
                "textsWithKeyWords": {
                    "text": [
                        "New Zealand has naturally stunning landscapes, friendly locals and heaps to do - all within short travelling distances."
                    ],
                    "keywords": [
                        "natural"
                    ]
                },
                "page": "https://www.airnewzealand.co.nz/destination-new-zealand"
            },
            {
                "textsWithKeyWords": {
                    "text": [
                        "Recognised as America's greenest city, Portland is passionate about treading more lightly on the Earth."
                    ],
                    "keywords": [
                        "green"
                    ]
                },
                "page": "https://www.airnewzealand.co.nz/destination-usa"
            },
            {
                "textsWithKeyWords": {
                    "text": [
                        "Spring is a gorgeous time to visit Vancouver. Flowers are blooming, the whales are on the move and the city's people are embracing the joys of warmer weather. You can explore Stanley Park, the green jewel of inner-city Vancouver. Or catch a floatplane to Vancouver Island for walks around historic Victoria, followed by a Cowichan Valley wine tour. It's always a great time to head up to Grouse Mountain for sky-high views and bear photos. You can also throw in a road or train trip to the Rockies for good measure. Another popular attraction is the FlyOver Canada virtual flightseeing tour that delights passengers of all ages."
                    ],
                    "keywords": [
                        "green"
                    ]
                },
                "page": "https://www.airnewzealand.co.nz/destination-vancouver"
            },
            {
                "textsWithKeyWords": {
                    "text": [
                        "Savour exciting Hong Kong's varied and contrasting delights, from natural splendour to vivacious nightlife."
                    ],
                    "keywords": [
                        "natural"
                    ]
                },
                "page": "https://www.airnewzealand.co.nz/destination-asia"
            }
        ]
    },
    {
        "domain": "https://www.hallensteins.com",
        "quotes": "The text mentions the use of traceable flax produced exclusively in France, Belgium or the Netherlands for their Linen Range, which ensures that the environment is respected at every step of the process. The text also mentions the use of Organic Cotton, which is certified by an independent third party. These statements suggest that the company is conscious of environmental and sustainability issues.\n\nDirect quotes:\n- \"our Linen Range is crafted from traceable flax produced exclusively in France, Belgium or the Netherlands. Traceability ensures the environment, as well as the producers, are respected at every step of the process.\"\n- \"At Hallenstein Brothers we use Asiatic cotton and Organic Cotton which is certified by an independent third party.\"",
        "pagesWithKeywords": [
            {
                "textsWithKeyWords": {
                    "text": [
                        "\n\t\t\t\t\t\t\t\tLinen is a natural fibre derived from flax. Lightweight and breathable, it is generally worn through the warmer months through shirting and tailoring. Made in a way we’re proud of, our Linen Range is crafted from traceable flax produced exclusively in France, Belgium or the Netherlands. Traceability ensures the environment, as well as the producers, are respected at every step of the process. Our new range brings updated styling and soft yet durable wear. Great for any season, linen is a natural fibre that drapes nicely through pants and shirting which are perfect for both casual and formal wear. \t\t\t\t\t\t\t",
                        "\n\t\t\t\t\t\t\t\tCotton is a natural fibre that is used across our range of clothing in a variety of ways. Cotton is spun into yarn that can be woven into a soft and durable fabric. At Hallenstein Brothers we use Asiatic cotton and Organic Cotton which is certified by an independent third party. Cotton can be woven in a variety of ways to create every day fabrics for you to enjoy, including corduroy, denim, velour and fleece. Cotton is normally easy to care for through machine washing and hang drying but refer to care instructions to ensure the longevity of your garments.\t\t\t\t\t\t\t"
                    ],
                    "keywords": [
                        "natural"
                    ]
                },
                "page": "https://www.hallensteins.com/faqs"
            }
        ]
    },
    {
        "domain": "https://hellpizza.nz",
        "quotes": "The text contains several statements related to environmental and sustainability issues. HELL Pizza is committed to reducing waste going to landfills, using recycled materials, buying locally made materials, and selecting suppliers who share their values for ethics and sustainability. They also offer sustainable food options and use free-range ingredients. HELL Pizza is committed to leading the way in the food sector and showing other brands what's possible when it comes to operating a sustainable food business. They offset carbon emissions and use electric delivery vehicles made from recycled fibers. They plan to measure and record the sustainability of their suppliers and producers of food to make more informed choices. Finally, HELL Pizza is committed to keeping their team happy, safe, and supporting the communities they operate in.\n\nDirect quotes:\n- \"We’re working to  reduce the amount of waste going to our landfills, and the natural resources that are only used once, by choosing recycled materials where possible.\"\n- \"Currently 98.6% of our packaging is recyclable, and",
        "pagesWithKeywords": [
            {
                "textsWithKeyWords": {
                    "text": [
                        "We’re working to  reduce the amount of waste going to our landfills, and the natural resources that are only used once, by choosing recycled materials where possible. Currently 98.6% of our packaging is recyclable, and 96% is made from recycled fibres. We also choose to buy locally made materials wherever possible to reduce our transport and freight footprint.",
                        "Wherever possible, we carefully select suppliers who share our values for ethics and sustainability (e.g., our pizzas are free-range).  We proactively seek out new sustainable food options (e.g. alternative proteins), so we have accessible, delicious products our customers can experiment with – incorporating greener choices into their diets at their own pace.",
                        "HELL is a market leader when it comes to sourcing sustainable food and was one of the first to go free-range and prioritise sustainability in our supply chain. That's why more than 86% of our products are locally sourced and produced.",
                        "We make more than 50,000 pizzas each week for hungry Kiwis, using a significant quantity of food in the process. In addition, the production and transportation of raw ingredients uses a significant amount of natural resources.",
                        "HELL’s delivery vehicles are electric - silently delivering hot, tasty, and sustainable treats in boxes made locally from recycled fibres (and looking damn good while they do it).",
                        "We also plan to measure and record how “good” each of our suppliers and producers of food are. This will help us make more informed choices on who to partner with – ultimately influencing our own sustainable pathway by encouraging suppliers to produce their food in more environmentally efficient ways.",
                        "Any carbon emissions created by HELL are offset by purchasing high-quality carbon credits, which are used in the regeneration and conservation of native forests, creating a greener, happier world that even the Master approves of.",
                        "HELL relies on a workforce of dedicated, positive, skilled people – from our head office to our franchisees and store staff. To have a sustainable future we need to keep our team happy, safe and have a pipeline of new people keen to work with us. HELL prides itself on being a locally owned and operated business, and we are keen to support the communities we operate in and empower our staff to play a role in this."
                    ],
                    "keywords": [
                        "green",
                        "natural",
                        "recyclable",
                        "recycled",
                        "sustainable"
                    ]
                },
                "page": "https://hellpizza.nz/wickedpedia/2021/09/28/sustainability-plan"
            },
            {
                "textsWithKeyWords": {
                    "text": [
                        "We want to be proactive in creating a sustainable future. Our deliveries are an obvious producer of carbon. Ideally, they would be emission-free with no need to offset; but until we can practically do that, we’re offsetting each delivery, and won’t be passing the costs onto our loyal customers.",
                        "We’ve always cared about reducing our environmental impact\n- much of our packaging is recycled and recyclable, we offer e-bike delivery in\nsome areas and use local free-range ingredients. ",
                        "HELL is committed to leading the way in our food sector and showing other brands what’s possible when it comes to operating a sustainable food business."
                    ],
                    "keywords": [
                        "recyclable",
                        "recycled",
                        "sustainable"
                    ]
                },
                "page": "https://hellpizza.nz/wickedpedia/2020/08/18/hell-deliveries-go-carbon-neutral"
            },
            {
                "textsWithKeyWords": {
                    "text": [
                        "We have max respect for Mother Nature, and we continue to explore cleaner, greener ways to go about our business."
                    ],
                    "keywords": [
                        "green"
                    ]
                },
                "page": "https://hellpizza.nz/wickedpedia/tags/sustainability"
            },
            {
                "textsWithKeyWords": {
                    "text": [],
                    "keywords": [
                        "green"
                    ]
                },
                "page": "https://hellpizza.nz/assets/pdfs/menu/menu-web-01-23.pdf"
            }
        ]
    },
    {
        "domain": "https://www.myfoodbag.co.nz",
        "quotes": "The text contains several statements related to environmental and sustainability issues. The company is committed to reducing landfill and introducing recyclable alternatives for their packaging. They also mention that research shows their meal kits have lower greenhouse gas emissions than supermarket-bought meals. The company is working to monitor and reduce their greenhouse gas emissions and operational waste through innovative ideas and partnerships. They also mention the importance of shaping a sustainable New Zealand, particularly for children. The company uses sustainable packaging and ingredients, including recycled cardboard and plastic, and water-based ice packs.\n\nDirect quotes:\n- \"We're continuously reviewing and improving our packaging to ensure we reduce landfill and introduce recyclable alternatives, without compromising food quality and safety.\"\n- \"Research shows meal kits have lower average greenhouse gas emissions than supermarket-bought meals*.\"\n- \"Through innovative ideas and strong partnerships we are working to comprehensively monitor and reduce our greenhouse gas emissions and operational waste.\"\n- \"We currently have the 3rd highest rate of obesity in the OECD and Kiwi kids",
        "pagesWithKeywords": [
            {
                "textsWithKeyWords": {
                    "text": [
                        "Through innovative ideas and strong partnerships we are working to comprehensively monitor and reduce our greenhouse gas emissions and operational waste.",
                        "We're continuously reviewing and improving our packaging to ensure we reduce landfill and introduce recyclable alternatives, without compromising food quality and safety.",
                        "Research shows meal kits have lower average greenhouse gas emissions than supermarket-bought meals*.",
                        "Our boxes are made of 47% recycled cardboard & FSC certified virgin cardboard, MADE trays composed of 80% recycled plastic, and our ice packs are 100% water."
                    ],
                    "keywords": [
                        "green",
                        "recyclable",
                        "recycled"
                    ]
                },
                "page": "https://www.myfoodbag.co.nz/sustainability"
            },
            {
                "textsWithKeyWords": {
                    "text": [
                        "Great recipes, good choice and sustainable packaging and ingredients.  "
                    ],
                    "keywords": [
                        "sustainable"
                    ]
                },
                "page": "https://www.myfoodbag.co.nz#"
            },
            {
                "textsWithKeyWords": {
                    "text": [
                        "We currently have the 3rd highest rate of obesity in the OECD and Kiwi kids play a critical role in how we shape a sustainable New Zealand."
                    ],
                    "keywords": [
                        "sustainable"
                    ]
                },
                "page": "https://www.myfoodbag.co.nz/garden-to-table"
            }
        ]
    },
    {
        "domain": "https://www.burgerfuel.com",
        "quotes": "The text emphasizes the use of natural and pure ingredients in BurgerFuel's products, including free-range chicken and all-natural thickshakes. There is also a mention of the company's commitment to preparing meals with care and respect. \n\nDirect quotes: \n- \"your engine deserves the most pure, natural ingredients, ripped straight from mother natures sweet bosom before anyone's had the chance to defile them\"\n- \"Our sweet, tomato relish is crafted using whole fresh fruit and vegetables, selected herbs and natural spices. Naturally sweet and aged to perfection.\"\n- \"Our chicken is the real deal - we never use fillers and it must be ethically raised. That's why we serve only 100% free range natural chicken breast - and say no to processing, hormones, additives, and GMO's.\"\n- \"All-natural BurgerFuel Thickshakes made fresh to order.\"\n- \"we leave no stone unturned in our relentless quest for the freshest, most pure, natural",
        "pagesWithKeywords": [
            {
                "textsWithKeyWords": {
                    "text": [
                        "Batch brewed tomato relish, naturally aged so the acid drops and the sweetness hops.",
                        "Our sweet, tomato relish is crafted using whole fresh fruit and vegetables, selected herbs and natural spices. Naturally sweet and aged to perfection.",
                        "Fresh natural aioli. Just another taste. Just another hit. Addiction made daily. ​",
                        "Our chicken is the real deal - we never use fillers and it must be ethically raised. That's why we serve only 100% free range natural chicken breast - and say no to processing, hormones, additives, and GMO's.",
                        "You deserve nothing less than the best. That's why we leave no stone unturned in our relentless quest for the freshest, most pure, natural ingredients we can get our hands on. It's also why we make sure that your meal is made to order, when you order, and prepared with the utmost care, preparation, and burger making respect."
                    ],
                    "keywords": [
                        "natural"
                    ]
                },
                "page": "https://www.burgerfuel.com/nz/our-food/pure-ingredients"
            },
            {
                "textsWithKeyWords": {
                    "text": [
                        "Cheeseburger, spud fries with fresh natural free range BurgerFuel Aioli or tomato sauce and a small juice",
                        "Milk thickshakes made with all-natural BurgerFuel Whip",
                        "Soy thickshakes made with all-natural BurgerFuel Whip"
                    ],
                    "keywords": [
                        "natural"
                    ]
                },
                "page": "https://www.burgerfuel.com/nz/order"
            },
            {
                "textsWithKeyWords": {
                    "text": [
                        "In the midst of our conversion into the digital era, we sometimes find ourselves on the edge of the fence, gazing over the paddocks trying to determine which grass is greener. The digital era ..."
                    ],
                    "keywords": [
                        "green"
                    ]
                },
                "page": "https://www.burgerfuel.com#mm-2"
            },
            {
                "textsWithKeyWords": {
                    "text": [
                        "All-natural BurgerFuel Thickshakes made fresh to order."
                    ],
                    "keywords": [
                        "natural"
                    ]
                },
                "page": "https://www.burgerfuel.com/nz/our-food/burgers"
            },
            {
                "textsWithKeyWords": {
                    "text": [
                        "You are an organic machine, a sensational human and your engine deserves the most pure, natural ingredients, ripped straight from mother natures sweet bosom before anyone's had the chance to defile them. Our super natural gourmet burgers are made to be eaten with pure, unadulterated, unbridled passion (there's no time for knives and forks here... but we're always down for a spoon, if you're offering) and every mouthful should be a celebration of the most beautiful things in life, like pure fuel and your bad assery."
                    ],
                    "keywords": [
                        "natural",
                        "organic"
                    ]
                },
                "page": "https://www.burgerfuel.com/nz/our-food/fuel-for-the-human-engine"
            }
        ]
    }
]